app/controllers/fruits_controller.rb

  def list
    puts "*************"
    puts params

    organic_val=false
    if params[:organic]=="true"
        organic_val = true
    end

    if params[:and_or]=="AND"
        @fruits = Fruit.where(species: params[:species], organic: organic_val)
    else
        @fruits = Fruit.arel_table
        species_fruits = @fruits[:species].eq(params[:species])
        organic_fruits = @fruits[:organic].eq(organic_val)
        @fruits = Fruit.where(species_fruits.or(organic_fruits))
---
SELECT "fruits".* FROM "fruits" WHERE "fruits"."species" = ? AND "fruits"."organic" = ?  [["species", "orange"], ["organic", "false"]]
SELECT "fruits".* FROM "fruits" WHERE "fruits"."organic" = ?  [["organic", "true"]]

  def index
    @fruits = Fruit.all
---
SELECT "fruits".* FROM "fruits"

  def create
    @fruit = Fruit.new(fruit_params)

    respond_to do |format|
      if @fruit.save
---
INSERT INTO "fruits" ("species", "organic", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["species", "apple"], ["organic", "t"], ["created_at", "2015-03-09 22:15:12.427346"], ["updated_at", "2015-03-09 22:15:12.427346"]]

  def update
    respond_to do |format|
      if @fruit.update(fruit_params)
---
UPDATE "fruits" SET "organic" = ?, "updated_at" = ? WHERE "fruits"."id" = ?  [["organic", "f"], ["updated_at", "2015-03-13 00:11:10.913853"], ["id", 1]]

    def set_fruit
      @fruit = Fruit.find(params[:id])
---
SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = ? LIMIT 1  [["id", 1]]