app/controllers/fruits_controller.rb

  def search
    @fruit = Fruit.where(species: params[:species])
---
SELECT "fruits".* FROM "fruits" WHERE "fruits"."species" = ?  [["species", "apple"]]